---
kind: other
id: Properties.T:Autodesk.Revit.DB.TriangulatedSolidOrShell
source: html/b188fd69-c541-b4e2-ab0d-39b2ec77f499.htm
---
# TriangulatedSolidOrShell Properties

Specifies whether the .NET object represents a valid Revit entity.